
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 12 to add, 0 to change, 12 to destroy.</code></pre>

* Replace
  * azurerm_key_vault_secret.POSTGRES-PASS-V15
  * azurerm_key_vault_secret.POSTGRES-USER-V15
  * azurerm_key_vault_secret.POSTGRES_DATABASE-V15
  * azurerm_key_vault_secret.POSTGRES_HOST-V15
  * azurerm_key_vault_secret.POSTGRES_PORT-V15
  * module.db-common-data-v15.azurerm_postgresql_flexible_server.pgsql_server
  * module.db-common-data-v15.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.db-common-data-v15.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.db-common-data-v15.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.db-common-data-v15.azurerm_postgresql_flexible_server_database.pg_databases[&#34;rd-commondata-api-db&#34;]
  * module.db-common-data-v15.azurerm_resource_group.rg[0]
  * module.db-common-data-v15.null_resource.set-user-permissions-additionaldbs[&#34;rd-commondata-api-db&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS-V15 must be replaced
-/+ resource "azurerm_key_vault_secret" "POSTGRES-PASS-V15" {
      ~ id                      = "https://rd-aat.vault.azure.net/secrets/commondata-api-POSTGRES-PASS-V15/c161fde9344444fcb7f392084c4e6f92" -> (known after apply)
      ~ name                    = "commondata-api-POSTGRES-PASS-V15" -> "postgres-db-v15-POSTGRES-PASS-V15" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat/secrets/commondata-api-POSTGRES-PASS-V15/versions/c161fde9344444fcb7f392084c4e6f92" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat/secrets/commondata-api-POSTGRES-PASS-V15" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "c161fde9344444fcb7f392084c4e6f92" -> (known after apply)
      ~ versionless_id          = "https://rd-aat.vault.azure.net/secrets/commondata-api-POSTGRES-PASS-V15" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES-USER-V15 must be replaced
-/+ resource "azurerm_key_vault_secret" "POSTGRES-USER-V15" {
      ~ id                      = "https://rd-aat.vault.azure.net/secrets/commondata-api-POSTGRES-USER-V15/347f47e1e3c2463089249c003c402d54" -> (known after apply)
      ~ name                    = "commondata-api-POSTGRES-USER-V15" -> "postgres-db-v15-POSTGRES-USER-V15" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat/secrets/commondata-api-POSTGRES-USER-V15/versions/347f47e1e3c2463089249c003c402d54" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat/secrets/commondata-api-POSTGRES-USER-V15" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "347f47e1e3c2463089249c003c402d54" -> (known after apply)
      ~ versionless_id          = "https://rd-aat.vault.azure.net/secrets/commondata-api-POSTGRES-USER-V15" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE-V15 must be replaced
-/+ resource "azurerm_key_vault_secret" "POSTGRES_DATABASE-V15" {
      ~ id                      = "https://rd-aat.vault.azure.net/secrets/commondata-api-POSTGRES-DATABASE-V15/4acdd9e6870e4e3aa7cd2304b8003d68" -> (known after apply)
      ~ name                    = "commondata-api-POSTGRES-DATABASE-V15" -> "postgres-db-v15-POSTGRES-DATABASE-V15" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat/secrets/commondata-api-POSTGRES-DATABASE-V15/versions/4acdd9e6870e4e3aa7cd2304b8003d68" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat/secrets/commondata-api-POSTGRES-DATABASE-V15" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "4acdd9e6870e4e3aa7cd2304b8003d68" -> (known after apply)
      ~ versionless_id          = "https://rd-aat.vault.azure.net/secrets/commondata-api-POSTGRES-DATABASE-V15" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST-V15 must be replaced
-/+ resource "azurerm_key_vault_secret" "POSTGRES_HOST-V15" {
      ~ id                      = "https://rd-aat.vault.azure.net/secrets/commondata-api-POSTGRES-HOST-V15/f9208b8850fa4532ab30a83ecd014795" -> (known after apply)
      ~ name                    = "commondata-api-POSTGRES-HOST-V15" -> "postgres-db-v15-POSTGRES-HOST-V15" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat/secrets/commondata-api-POSTGRES-HOST-V15/versions/f9208b8850fa4532ab30a83ecd014795" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat/secrets/commondata-api-POSTGRES-HOST-V15" -> (known after apply)
      - tags                    = {} -> null
      ~ value                   = (sensitive value)
      ~ version                 = "f9208b8850fa4532ab30a83ecd014795" -> (known after apply)
      ~ versionless_id          = "https://rd-aat.vault.azure.net/secrets/commondata-api-POSTGRES-HOST-V15" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_PORT-V15 must be replaced
-/+ resource "azurerm_key_vault_secret" "POSTGRES_PORT-V15" {
      ~ id                      = "https://rd-aat.vault.azure.net/secrets/commondata-api-POSTGRES-PORT-V15/c794dc903d3a46fc95d2b1afad555d19" -> (known after apply)
      ~ name                    = "commondata-api-POSTGRES-PORT-V15" -> "postgres-db-v15-POSTGRES-PORT-V15" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat/secrets/commondata-api-POSTGRES-PORT-V15/versions/c794dc903d3a46fc95d2b1afad555d19" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat/secrets/commondata-api-POSTGRES-PORT-V15" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "c794dc903d3a46fc95d2b1afad555d19" -> (known after apply)
      ~ versionless_id          = "https://rd-aat.vault.azure.net/secrets/commondata-api-POSTGRES-PORT-V15" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.db-common-data-v15.azurerm_postgresql_flexible_server.pgsql_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      ~ fqdn                          = "rd-postgres-db-v15-aat.postgres.database.azure.com" -> (known after apply)
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/rd-postgres-db-v15-aat" -> (known after apply)
      ~ name                          = "rd-postgres-db-v15-aat" -> "rd-commondata-api-postgres-db-v15-aat" # forces replacement
      ~ public_network_access_enabled = false -> (known after apply)
      ~ resource_group_name           = "rd-postgres-db-v15-data-aat" -> "rd-commondata-api-postgres-db-v15-data-aat" # forces replacement
        tags                          = {
            "application"         = "reference-data"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/rd-commondata-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#ref-data-support"
            "environment"         = "staging"
            "managedBy"           = "Reference Data"
        }
      - zone                          = "1" -> null
        # (12 unchanged attributes hidden)

      ~ high_availability {
          - standby_availability_zone = "2" -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.db-common-data-v15.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin must be replaced
-/+ resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      ~ id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/rd-postgres-db-v15-aat/administrators/e7ea2042-4ced-45dd-8ae3-e051c6551789" -> (known after apply)
      ~ resource_group_name = "rd-postgres-db-v15-data-aat" -> "rd-commondata-api-postgres-db-v15-data-aat" # forces replacement
      ~ server_name         = "rd-postgres-db-v15-aat" -> "rd-commondata-api-postgres-db-v15-aat" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.db-common-data-v15.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      ~ id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/rd-postgres-db-v15-aat/administrators/ca6d5085-485a-417d-8480-c3cefa29df31" -> (known after apply)
      ~ resource_group_name = "rd-postgres-db-v15-data-aat" -> "rd-commondata-api-postgres-db-v15-data-aat" # forces replacement
      ~ server_name         = "rd-postgres-db-v15-aat" -> "rd-commondata-api-postgres-db-v15-aat" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.db-common-data-v15.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/rd-postgres-db-v15-aat/configurations/backslash_quote" -> (known after apply)
        name      = "backslash_quote"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/rd-postgres-db-v15-aat" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.db-common-data-v15.azurerm_postgresql_flexible_server_database.pg_databases["rd-commondata-api-db"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/rd-postgres-db-v15-aat/databases/rd-commondata-api-db" -> (known after apply)
        name      = "rd-commondata-api-db"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/rd-postgres-db-v15-aat" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.db-common-data-v15.azurerm_resource_group.rg[0] must be replaced
-/+ resource "azurerm_resource_group" "rg" {
      ~ id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-postgres-db-v15-data-aat" -> (known after apply)
      ~ name     = "rd-postgres-db-v15-data-aat" -> "rd-commondata-api-postgres-db-v15-data-aat" # forces replacement
        tags     = {
            "application"         = "reference-data"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/rd-commondata-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#ref-data-support"
            "environment"         = "staging"
            "managedBy"           = "Reference Data"
        }
        # (1 unchanged attribute hidden)
    }

  # module.db-common-data-v15.null_resource.set-user-permissions-additionaldbs["rd-commondata-api-db"] must be replaced
-/+ resource "null_resource" "set-user-permissions-additionaldbs" {
      ~ id       = "8278212478984716569" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "name"           = "rd-postgres-db-v15" -> "rd-commondata-api-postgres-db-v15"
            # (2 unchanged elements hidden)
        }
    }

Plan: 12 to add, 0 to change, 12 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":330,"Program":"tfcmt","SHA1":"","Vars":{}} -->